/*
 * Логічні оператори (&& || !)
 */

//* && - запинається на брехні
//* Якщо операнд був преведенний до false, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до true, то повертається значення останнього операнду.
// const result = 10 && 0 && 2;

// console.log(result);

//* || - запинається на правді
//* Якщо операнд був преведенний до true, то повертається значення цього операнду.
//* Якщо всі операнди були приведені до false, то повертається останній.
// const username = prompt('Ваше імʼя') || 'anonymus';

// console.log(`Hello ${username}!`);

//* ! - інвертує правду до брехні, а брехню до правди

// console.log(!'Hello');
